{
  "Orchid": {
    "release_complete": true,
    "api_minor": 0,
    "date": "2021-05-27",
    "readable_date": "May 27th, 2021",
    "message": "This release brings the long awaited AutoTest caching feature! With this feature the result of the global setup will be cached, which significantly reduces the startup time of AutoTest for students.",
    "version": "Orchid",
    "ui_preference": "no_msg_for_orchid"
  },
  "Nobel.2": {
    "release_complete": true,
    "api_minor": 2,
    "date": "2021-03-09",
    "readable_date": "March 9th, 2021",
    "message": "This release makes it easier to allow late submissions using the lock date, making it possible to allow late submissions up to a certain date. We've also updated various software packages in AutoTest, and made it easier to use the `CG_INFO` information.",
    "version": "Nobel.2",
    "ui_preference": "no_msg_for_nobel_2"
  },
  "Nobel.1": {
    "release_complete": true,
    "api_minor": 4,
    "date": "2021-01-28",
    "readable_date": "January 28th, 2021",
    "message": "This release kicks off our push to make AutoTest even better this year. You can now give even more accurate feedback by customizing AutoTest messages, and the workflow for uploading fixtures has been optimized.",
    "version": "Nobel.1",
    "ui_preference": "no_msg_for_nobel_1"
  },
  "Nobel": {
    "release_complete": true,
    "date": "2020-12-23",
    "readable_date": "December 26th, 2020",
    "message": "In this release we have made CodeGrade ready for a new infrastructure, so that we can provide a faster and more reliable experience. Happy new year from all of us at CodeGrade!",
    "version": "Nobel",
    "ui_preference": "no_msg_for_nobel"
  },
  "Mosaic.3": {
    "release_complete": true,
    "date": "2020-11-26",
    "readable_date": "November 26th, 2020",
    "message": "This release brings many small fixes and improvements, and is the last release on our old infrastructure. We will migrate CodeGrade to AWS on the 28th and 29th of December, during which CodeGrade might not be available.",
    "version": "Mosaic.3",
    "ui_preference": "no_msg_for_mosaic_3"
  },
  "Mosaic.2": {
    "release_complete": true,
    "date": "2020-10-22",
    "readable_date": "October 22nd, 2020",
    "message": "The Rubric Editor has a new design, which allows you to reorder categories and use markdown. The new Code Quality step in AutoTest allows you to grade and add inline comments to submissions based on code style. This will replace the current Linters integration.",
    "version": "Mosaic.2",
    "ui_preference": "no_msg_for_mosaic_2"
  },
  "Mosaic.1": {
    "release_complete": true,
    "date": "2020-09-09",
    "readable_date": "September 9th, 2020",
    "message": "CodeGrade now has an Exam mode in which students will be able to log in to CodeGrade and only have access to the course of the exam. Other changes include course archiving, importing of hand-in requirements, and including even more information in the AutoTest Unit Test output.",
    "version": "Mosaic.1",
    "ui_preference": "no_msg_for_mosaic_1"
  }
}
